benchmarks/v1-blocking/ab.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        
Server Hostname:        localhost
Server Port:            8000

Document Path:          /
Document Length:        31425 bytes

Concurrency Level:      100
Time taken for tests:   27.819 seconds
Complete requests:      1000
Failed requests:        5
   (Connect: 0, Receive: 0, Length: 5, Exceptions: 0)
Total transferred:      32512250 bytes
HTML transferred:       31425250 bytes
Requests per second:    35.95 [#/sec] (mean)
Time per request:       2781.862 [ms] (mean)
Time per request:       27.819 [ms] (mean, across all concurrent requests)
Transfer rate:          1141.33 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.5      0       2
Processing:    38 2398 431.6   2422    2981
Waiting:       36 2396 431.7   2420    2978
Total:         40 2398 431.2   2422    2981

Percentage of the requests served within a certain time (ms)
  50%   2422
  66%   2469
  75%   2509
  80%   2551
  90%   2813
  95%   2887
  98%   2917
  99%   2957
 100%   2981 (longest request)